RIET/src/Catalogs/TNVEDCodes/TNVEDCodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TNVEDCodes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ShortDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UOM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DisposableGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/TNVEDCodes/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();
	
	ПроверитьЗаполнениеРеквизитов(Отказ);		
		
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	РГСофтКлиентСервер.УстановитьЗначение(Код, СокрЛП(Код));
	РГСофтКлиентСервер.УстановитьЗначение(ShortDescription, СокрЛП(ShortDescription));
	РГСофтКлиентСервер.УстановитьЗначение(FullDescription, ПолучитьFullDescription());
	Если НЕ ЭтоГруппа Тогда
		РГСофтКлиентСервер.УстановитьЗначение(UOM, СокрЛП(UOM));
		РГСофтКлиентСервер.УстановитьЗначение(Rate, СокрЛП(Rate));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьFullDescription()
		
	Если ЗначениеЗаполнено(Родитель) Тогда
		GroupFullDescription = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Родитель, "FullDescription");
		NewFullDescription = GroupFullDescription + " " + ShortDescription;
	Иначе
		NewFullDescription = ShortDescription;
	КонецЕсли;
	
	Возврат СокрЛП(NewFullDescription);
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Code"" не заполнено!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ShortDescription) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Short description"" не заполнено!",
			ЭтотОбъект, "ShortDescription", , Отказ);
	КонецЕсли;
	
КонецПроцедуры
